SE4Foam/tutorials/chtMultiRegionSimple4SEFoam/solarAirHeater/system/metalSheet/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default				steadyState;
}

gradSchemes
{
    default				Gauss linear;
}

divSchemes
{
    default				none;
}

laplacianSchemes
{
    default				none;
    laplacian(Kappa,T)			Gauss linear limited 0.333;
}

interpolationSchemes
{
    default				linear;
}

snGradSchemes
{
    default				limited 0.333;
}


// ************************************************************************* //
