SE4Foam/tutorials/chtMultiRegionSimple4SEFoam/solarAirHeater/system/channel/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    U
    {
        internalField   uniform (0 0 0);

        boundaryField
        {
            inlet
            {
                type            fixedValue;
                value           uniform (0.372 0 0);
            }

            outlet
            {
                type            zeroGradient;
            }

            top
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            bottom
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            channel_to_metalSheet
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            channel_to_fin1
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            channel_to_fin2
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            channel_to_fin3
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
        }
    }

    T
    {
        internalField   uniform 296;

        boundaryField
        {
            inlet
            {
                type            fixedValue;
                value           uniform 296;
            }

            outlet
            {
                type            zeroGradient;
            }

            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            channel_to_metalSheet
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName metalSheet;
                neighbourPatchName metalSheet_to_channel;
                neighbourFieldName T;
                Kappa           kappaEff;
                value           uniform 296;
            }

            channel_to_fin1
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName fin1;
                neighbourPatchName fin1_to_channel;
                neighbourFieldName T;
                Kappa           kappaEff;
                value           uniform 296;
            }

            channel_to_fin2
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName fin2;
                neighbourPatchName fin2_to_channel;
                neighbourFieldName T;
                Kappa           kappaEff;
                value           uniform 296;
            }

            channel_to_fin3
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName fin3;
                neighbourPatchName fin3_to_channel;
                neighbourFieldName T;
                Kappa           kappaEff;
                value           uniform 296;
            }
        }
    }

    p
    {
        internalField   uniform 0;

        boundaryField
        {
            inlet
            {
                type            zeroGradient;
            }

            outlet
            {
                type            fixedValue;
                value           uniform 0;
            }

            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            channel_to_metalSheet
            {
                type            zeroGradient;
            }

            channel_to_fin1
            {
                type            zeroGradient;
            }

            channel_to_fin2
            {
                type            zeroGradient;
            }

            channel_to_fin3
            {
                type            zeroGradient;
            }
        }
    }

// ************************************************************************* //
