SE4Foam/tutorials/chtMultiRegionSimple4SEFoam/solarAirHeater/system/fin2/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        internalField   uniform 296;

        boundaryField
        {
            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            fin2_to_channel
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName channel;
                neighbourPatchName channel_to_fin2;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }

            fin2_to_metalSheet
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName metalSheet;
                neighbourPatchName metalSheet_to_fin2;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }
        }
    }

    rho
    {
        internalField   uniform 8900;

        boundaryField
        {
            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            fin2_to_channel
            {
                type            zeroGradient;
            }

            fin2_to_metalSheet
            {
                type            zeroGradient;
            }
        }
    }

    Kappa
    {
        internalField   uniform 398;

        boundaryField
        {
            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            fin2_to_channel
            {
                type            zeroGradient;
            }

            fin2_to_metalSheet
            {
                type            zeroGradient;
            }
        }
    }

    cp
    {
        internalField   uniform 386;

        boundaryField
        {
            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            fin2_to_channel
            {
                type            zeroGradient;
            }

            fin2_to_metalSheet
            {
                type            zeroGradient;
            }
        }
    }
}


// ************************************************************************* //
