SE4Foam/tutorials/chtMultiRegionSimple4SEFoam/solarAirHeater/system/metalSheet/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        internalField   uniform 296;

        boundaryField
        {
            top
            {
                type		robin4SEFoam;
                Kappa		Kappa;
                qo              (400);
                ho              (5.0);
                To              (296.0);
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            metalSheet_to_channel
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName channel;
                neighbourPatchName channel_to_metalSheet;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }

            metalSheet_to_fin1
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName fin1;
                neighbourPatchName fin1_to_metalSheet;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }

            metalSheet_to_fin2
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName fin2;
                neighbourPatchName fin2_to_metalSheet;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }

            metalSheet_to_fin3
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName fin3;
                neighbourPatchName fin3_to_metalSheet;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 296;
            }
        }
    }

    rho
    {
        internalField   uniform 8900;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            metalSheet_to_channel
            {
                type            zeroGradient;
            }

            metalSheet_to_fin1
            {
                type            zeroGradient;
            }

            metalSheet_to_fin2
            {
                type            zeroGradient;
            }

            metalSheet_to_fin3
            {
                type            zeroGradient;
            }
        }
    }

    Kappa
    {
        internalField   uniform 398;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            metalSheet_to_channel
            {
                type            zeroGradient;
            }

            metalSheet_to_fin1
            {
                type            zeroGradient;
            }

            metalSheet_to_fin2
            {
                type            zeroGradient;
            }

            metalSheet_to_fin3
            {
                type            zeroGradient;
            }
        }
    }

    cp
    {
        internalField   uniform 386;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            front
            {
                type            empty;
            }

            back
            {
                type            empty;
            }

            metalSheet_to_channel
            {
                type            zeroGradient;
            }

            metalSheet_to_fin1
            {
                type            zeroGradient;
            }

            metalSheet_to_fin2
            {
                type            zeroGradient;
            }

            metalSheet_to_fin3
            {
                type            zeroGradient;
            }
        }
    }
}


// ************************************************************************* //
